<a href="https://colab.research.google.com/github/Mann822/Praktikum-Basissdata/blob/main/bab4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. ALTER TABLE

ALTER TABLE digunakan untuk mengubah struktur sebuah tabel, tanpa harus menghapus tabel tersebut. Ada 4 perubahan utama yang bisa dilakukan:

a. Mengubah nama kolom (Change)

Digunakan ketika nama kolom salah atau ingin diperbarui.

Sintaks:

ALTER TABLE nama_tabel
CHANGE nama_lama nama_baru tipe_data;

Contoh:

ALTER TABLE mahasiswa
CHANGE Nama Nama_Mhs CHAR(40);

Fungsi: mengganti nama kolom “Nama” menjadi “Nama_Mhs”.


---

b. Mengubah tipe data kolom (Modify)

Jika ukuran atau tipe data tidak cocok, kita dapat memodifikasinya.

Sintaks:

ALTER TABLE nama_tabel
MODIFY nama_kolom tipe_data_baru;

Contoh:

ALTER TABLE mahasiswa
MODIFY NIM CHAR(8);

Fungsi: mengubah tipe data kolom NIM menjadi CHAR(8).


---

c. Menambah kolom baru (Add)

Dipakai jika tabel membutuhkan data tambahan.

Sintaks:

ALTER TABLE nama_tabel
ADD nama_kolom_baru tipe_data;

Contoh:

ALTER TABLE mahasiswa
ADD Fakultas VARCHAR(30);


---

d. Menghapus kolom (Drop Column)

Dipakai jika suatu kolom sudah tidak diperlukan.

Sintaks:

ALTER TABLE nama_tabel
DROP COLUMN nama_kolom;

Contoh:

ALTER TABLE mahasiswa
DROP COLUMN Fakultas;


---

2. DROP TABLE

Perintah DROP TABLE digunakan untuk menghapus tabel beserta seluruh datanya.
Jika tabel tidak dibutuhkan lagi, kita dapat menghapusnya.

Sintaks:

DROP TABLE nama_tabel;

Contoh:

DROP TABLE Mhs;

Peringatan:
❗ Perintah ini menghapus tabel secara permanen, tidak bisa di-undo.


---

3. RENAME TABLE

Digunakan untuk mengganti nama tabel. Biasanya dipakai ketika nama tabel tidak sesuai atau perlu diperjelas.

Sintaks:

RENAME TABLE nama_lama TO nama_baru;

Contoh:

RENAME TABLE mahasiswa TO data_mahasiswa;